Revit 2027 API
GroupType.GetAvailableAttachedDetailGroupTypeIds Method
 Returns the attached detail groups available for this element group type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetAvailableAttachedDetailGroupTypeIds()
Public Function GetAvailableAttachedDetailGroupTypeIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetAvailableAttachedDetailGroupTypeIds()
member GetAvailableAttachedDetailGroupTypeIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Returns the collection of attached detail group Ids that match this group's type.
See Also
Reference
GroupType Class
Autodesk.Revit.DB Namespace